name: "llama2_7b"
backend: "python"

# Disabling batching in Triton, let vLLM handle the batching on its own.
# https://github.com/vllm-project/vllm/issues/541
max_batch_size: 0

# TODO: need to use decupled mode for max throughput
model_transaction_policy {
  decoupled: False
}

parameters: {
  key: "EXECUTION_ENV_PATH",
  value: {string_value: "/conda-pack/python-3-8.tar.gz"}
}

input [
  {
    name: "prompt"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "prompt_image"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  },
  {
    name: "max_new_tokens"
    data_type: TYPE_UINT32
    dims: [ 1 ]
  },
  {
   name: "stop_words"
   data_type: TYPE_STRING
   dims: [ -1 ]
  },
  {
    name: "temperature"
    data_type: TYPE_FP32
    dims: [ 1 ]
    optional: true
  },
  {
    name: "top_k"
    data_type: TYPE_INT32
    dims: [ 1 ]
    optional: true
  },
  {
    name: "random_seed"
    data_type: TYPE_UINT64
    dims: [ 1 ]
    optional: true
  },
  {
    name: "extra_params"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ -1, -1 ]
  }
]

# The usage of device is deferred to the vLLM engine
instance_group [
  {
    count: 1
    kind: KIND_MODEL
  }
]